---
type: PrimaryDesignOptionMemberFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# PrimaryDesignOptionMemberFilter

`Autodesk.Revit.DB.PrimaryDesignOptionMemberFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PrimaryDesignOptionMemberFilter | — | `` |
| Constructor | PrimaryDesignOptionMemberFilter | 2011 | `public PrimaryDesignOptionMemberFilter ()` |
| Method | PassesFilter | — | `` |